Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/oslomet.no.csv-nb-nn.deduped.tmx
Source language: nb
Languages: nn

source: I undervisningen tas det hensyn til at elevene har sine basiskunnskaper på et annet språk enn norsk, og at de derfor trenger intensiv undervisning for å utvikle både basisferdigheter, utbygde ferdigheter og fagspråk på andrespråket.
nn: I undervisninga tar ein omsyn til at elevane har basiskunnskapane sine på eit anna språk enn norsk, og at dei derfor treng intensiv undervisning for å utvikle både basisferdigheiter, utbygde ferdigheiter og fagspråk på andrespråket.

source: Utvikling av studentenes FoU-kompetanse er gjennomgående i de fem studieårene.
nn: Utvikling av FoU-kompetansen er gjennomgåande i dei fem studieåra.

source: Studentene skal tilegne seg kunnskap og ferdigheter som gjør dem i stand til å møte og forstå ulikheter og bruke mangfoldet som en ressurs i matematikkfaget.
nn: Studentane skal tileigne seg kunnskap og ferdigheiter som gjer dei i stand til å møte og forstå ulikskap og bruke mangfaldet som ein ressurs i norskfaget.

source: Etter fullført emne har studenten følgende læringsutbytte definert som kunnskap, ferdigheter og generell kompetanse
nn: Etter fullført emne har studenten følgjande læringsutbytte i faget definert som kunnskap, ferdigheiter og generell kompetanse:

source: Industriell produksjon, haute couture, handverkssaum og heimesaum hadde kvar sine sider, og skulle en skape brukbare og vakre klede måtte en kjenne til skilnaden
nn: Industriell produksjon, haute couture, handverkssaum og heimesaum hadde kvar sine sider, og skulle ein skape brukbare og vakre klede måtte ein kjenne til skilnaden

source: Forkunnskapskrav Etter fullført emne har studenten følgende læringsutbytte definert som kunnskap, ferdigheter og generell kompetanse:
nn: Etter fullført emne har studenten følgjande læringsutbytte i faget definert som kunnskap, ferdigheiter og generell kompetanse:

source: Studenten kan velge å skrive masteroppgave i en av de pedagogiske fordypningene profesjonsrettet pedagogikk, digital pedagogikk eller spesialpedagogikk.
nn: Studenten kan velje å skrive masteroppgåve i ei av dei pedagogiske fordjupingane profesjonsretta pedagogikk, digital pedagogikk eller spesialpedagogikk.

source: Å utvikle selvstendig FoU-kompetanse innebærer at studenten får erfaring med å lese forskningslitteratur og vitenskapelige tekster, å skrive selvstendige akademiske tekster og i tillegg få kunnskap om metodiske tilnærminger og vitenskapsfaglige tradisjoner.
nn: Å utvikle sjølvstendig FoU-kompetanse inneber at studenten får erfaring med å lese forskingslitteratur og vitskapelege tekstar, og med å skrive sjølvstendige akademiske tekstar, i tillegg får dei kunnskap om metodiske tilnærmingar og vitskapsfaglege tradisjonar.

source: Elever som har vokst opp i et hjem der et annet språk enn norsk er dominant, og som tilegner seg norsk som sitt andrespråk i skolen.
nn: Elevar som har vakse opp i ein heim der eit anna språk enn norsk er dominant, og som tileignar seg norsk som sitt andrespråk i skolen.

source: De grunnleggende ferdighetene – å kunne lese, skrive, regne, å kunne uttrykke seg muntlig og inneha digitale ferdigheter – er ferdigheter som er spesifikke for hvert fag, og som må forstås som en del av faget og dets tenkemåter.
nn: Dei grunnleggande ferdighetene – å kunne lese, skrive, rekne, å kunne uttrykke seg munnleg og digitale ferdigheiter – er ferdigheiter som er spesifikke for kvart fag, og som må forståast som ein del av faget og tenkemåtane i faget.

source: Det er ikke mulig å søke opptak til studiet på grunnlag av realkompetanse.
nn: Det er ikkje mogleg å søke opptak til studiet på grunnlag av realkompetanse.

source: kan identifisere tegn på mobbing, vold og seksuelle overgrep.
nn: kan identifisere teikn på mobbing, vald og seksuelle overgrep.

source: kan styrke internasjonale og flerkulturelle perspektiver ved skolens arbeid, bidra til forståelse av samenes status som urfolk og stimulere til demokratisk deltakelse og bærekraftig utvikling
nn: kan styrke internasjonale og fleirkulturelle perspektiv i arbeidet på skulen, bidra til forståing av samenes status som urfolk og stimulere til demokratisk deltaking og berekraftig utvikling

source: Kandidater som ikke består, eller har gyldig fravær ved ordinær eksamen, kan fremstille seg til ny/utsatt eksamen.
nn: Kandidatar som ikkje består, eller som har gyldig fråvær frå ordinær eksamen, kan melde seg opp til ny/utsett eksamen.

source: Høgskolen i Oslo og Akershus (HiOA) utdanner dyktige lærere til norsk skole.
nn: Høgskolen i Oslo og Akershus (HiOA) utdanner dyktige lærarar til norsk skule.

source: Michael Von Tetzschner frå Høgre kan melde om at det vil komme et nytt lovforslag basert på Datatilsynet sitt høringssvar, men vil ikke uttale seg meir om dette.
nn: Michael Von Tetzschner frå Høgre kan melde om at det vil komme eit nytt lovforslag basert på Datatilsynet sitt høringssvar, men vil ikkje uttale seg meir om dette.

source: Videre vil studentene bli presentert for sammenhengen mellom tilpasset undervisning og vurdering, og hvordan de kan bruke vurderingsinformasjon for å justere undervisningen underveis og dermed tilpasse opplæringen etter elevenes læringsbehov.
nn: Vidare vil studentane bli presenterte for samanhengen mellom tilpassa undervisning og vurdering, og korleis dei kan bruke vurderingsinformasjon for å justere undervisninga undervegs og dermed tilpasse opplæringa etter læringsbehova til elevane.

source: Utgangspunktet er et bredt mangfoldsbegrep som omfatter språk, livssyn, kjønn og kultur.
nn: Utgangspunktet er eit breitt mangfaldsomgrep som omfattar språk, livssyn, kjønn og kultur.

source: forskrift om studier og eksamen ved Høgskolen i Oslo og Akershus
nn: forskrift om studium og eksamen ved Høgskolen i Oslo og Akershus

source: Studentene skal i løpet av emnet gjennomføre fem obligatoriske oppgaver.
nn: Studentane skal i løpet av emnet gjennomføre fem obligatoriske oppgåver.

source: Differensiering er et verktøy for å tilpasse opplæringen til elevene i klassen, og studentene vil få kjennskap til hvordan man gjennom differensiering kan møte elevers ulike strategier for læring.
nn: Differensiering er eit verktøy for å tilpasse opplæringa til elevane i klassen, og studentane vil få kjennskap til ulike måtar å differensiere undervisninga på, og korleis ein gjennom differensiering kan møte ulike elevstrategiar for læring.

source: har avansert kunnskap enten i et valgt undervisningsfag og fagets didaktikk eller i profesjonsrettet pedagogikk/spesialpedagogikk
nn: har avansert kunnskap anten i eit valt undervisningsfag og didaktikken i faget eller i profesjonsretta pedagogikk/spesialpedagogikk

source: Informant F fortalde at det var en konflikt mellom pedagogikk og fagdidaktikk.
nn: Informant F fortalde at det var ein konflikt mellom pedagogikk og fagdidaktikk.

source: for mindre grupper i et samfunn, f.eks.
nn: for mindre grupper i eit samfunn, f.eks.

source: Lærer som underviser
nn: Lærar som underviser

source: sosial posisjon – om å bli «gründer» og gjera suksess som sjølvstendig nærings-drivande, men sett bort i frå en vellykka aksjehandel, og en viss suksess med å selja 32 Tidsskrift for ungdomsforskning
nn: sosial posisjon – om å bli «gründer» og gjera suksess som sjølvstendig nærings-drivande, men sett bort i frå ein vellykka aksjehandel, og ein viss suksess med å selja 32 Tidsskrift for ungdomsforskning

source: Faglige aktiviteter med krav om deltakelse
nn: Faglege aktivitetar med krav om deltaking

source: har inngående kunnskap om begynneropplæring, grunnleggende ferdigheter, vurderings- og kartleggingsverktøy, klasseledelse og vurdering av elevers læring og hva som fremmer læring i fagene
nn: har inngåande kunnskap om vidareutvikling av grunnleggjande ferdigheiter, vurderings- og prøvesystem, klasseleiing og vurdering av læring og kva som fremmar læring i faga

source: Ingen hjelpemidler tillatt.
nn: Ingen hjelpemiddel er tillatne.
